{
    "format": "graph-model",
    "generatedBy": "2.19.0",
    "convertedBy": "TensorFlow.js Converter v3.18.0",
    "signature": {
      "inputs": {
        "keras_tensor": {
          "name": "keras_tensor:0",
          "dtype": "float32",
          "tensorShape": {
            "dim": [
              {"size": "-1"},
              {"size": "63"}
            ]
          }
        }
      },
      "outputs": {
        "output_0": {
          "name": "Identity:0",
          "dtype": "float32",
          "tensorShape": {
            "dim": [
              {"size": "-1"},
              {"size": "26"}
            ]
          }
        }
      }
    },
    "modelTopology": {
      "node": [
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "float32",
                "tensorShape": {
                  "dim": [
                    {"size": "63"},
                    {"size": "128"}
                  ]
                }
              }
            },
            "dtype": {"type": "float32"}
          }
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "float32",
                "tensorShape": {
                  "dim": [
                    {"size": "128"}
                  ]
                }
              }
            },
            "dtype": {"type": "float32"}
          }
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "float32",
                "tensorShape": {
                  "dim": [
                    {"size": "128"},
                    {"size": "64"}
                  ]
                }
              }
            },
            "dtype": {"type": "float32"}
          }
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "float32",
                "tensorShape": {
                  "dim": [
                    {"size": "64"}
                  ]
                }
              }
            },
            "dtype": {"type": "float32"}
          }
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "float32",
                "tensorShape": {
                  "dim": [
                    {"size": "64"},
                    {"size": "26"}
                  ]
                }
              }
            },
            "dtype": {"type": "float32"}
          }
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "float32",
                "tensorShape": {
                  "dim": [
                    {"size": "26"}
                  ]
                }
              }
            },
            "dtype": {"type": "float32"}
          }
        },
        {
          "name": "keras_tensor",
          "op": "Placeholder",
          "attr": {
            "shape": {
              "shape": {
                "dim": [
                  {"size": "-1"},
                  {"size": "63"}
                ]
              }
            },
            "dtype": {"type": "float32"}
          }
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1/Relu",
          "op": "_FusedMatMul",
          "input": [
            "keras_tensor",
            "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp",
            "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "transpose_a": {"b": false},
            "_input_shapes": {
              "list": {
                "shape": [
                  {"dim": [{"size": "-3"}, {"size": "63"}]},
                  {"dim": [{"size": "63"}, {"size": "128"}]}
                ]
              }
            },
            "transpose_b": {"b": false},
            "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}},
            "leakyrelu_alpha": {"f": 0.2},
            "num_args": {"i": "1"},
            "epsilon": {"f": 0.0},
            "T": {"type": "float32"}
          }
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1_2/Relu",
          "op": "_FusedMatMul",
          "input": [
            "StatefulPartitionedCall/functional_1/dense_1/Relu",
            "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp",
            "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "transpose_a": {"b": false},
            "_input_shapes": {
              "list": {
                "shape": [
                  {"dim": [{"size": "-3"}, {"size": "128"}]},
                  {"dim": [{"size": "128"}, {"size": "64"}]}
                ]
              }
            },
            "transpose_b": {"b": false},
            "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}},
            "num_args": {"i": "1"},
            "leakyrelu_alpha": {"f": 0.2},
            "epsilon": {"f": 0.0},
            "T": {"type": "float32"}
          }
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd",
          "op": "_FusedMatMul",
          "input": [
            "StatefulPartitionedCall/functional_1/dense_1_2/Relu",
            "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp",
            "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "transpose_a": {"b": false},
            "_input_shapes": {
              "list": {
                "shape": [
                  {"dim": [{"size": "-3"}, {"size": "64"}]},
                  {"dim": [{"size": "64"}, {"size": "26"}]}
                ]
              }
            },
            "transpose_b": {"b": false},
            "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}},
            "num_args": {"i": "1"},
            "leakyrelu_alpha": {"f": 0.2},
            "epsilon": {"f": 0.0},
            "T": {"type": "float32"}
          }
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_2_1/Softmax",
          "op": "Softmax",
          "input": ["StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd"],
          "attr": {"T": {"type": "float32"}}
        },
        {
          "name": "Identity",
          "op": "Identity",
          "input": ["StatefulPartitionedCall/functional_1/dense_2_1/Softmax"],
          "attr": {"T": {"type": "float32"}}
        }
      ],
      "library": {},
      "versions": {"producer": 2129}
    },
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin"],
        "weights": [
          {
            "name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp",
            "shape": [63, 128],
            "dtype": "float32"
          },
          {
            "name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp",
            "shape": [128],
            "dtype": "float32"
          },
          {
            "name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp",
            "shape": [128, 64],
            "dtype": "float32"
          },
          {
            "name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp",
            "shape": [64],
            "dtype": "float32"
          },
          {
            "name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp",
            "shape": [64, 26],
            "dtype": "float32"
          },
          {
            "name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp",
            "shape": [26],
            "dtype": "float32"
          }
        ]
      }
    ]
  }